<?php
  /*-------------------------------------
  購入手続きプロセス
  -------------------------------------*/
  /*-------------------------------------
  変数宣言
  -------------------------------------*/

  //ページ情報
  $title = '購入手続き';
  $css_file_name = 'buy_procedures.css';
  //商品情報の取り出しカラム指定
  $product = [
    'id',
    'product_name',
    'price',
    'postage_id',
  ];
  //会員情報の取り出しカラム指定
  $member = [
    'address1',
    'address2',
    'address3',
    'proceeds',
    'point',
  ];

  /*-------------------------------------
  値受取
  -------------------------------------*/
  //postで値受取(受け取っていない場合はエラーを返す)
  //購入確認が押されたとき
  if(!isset($_POST['submit'])){
    //不正アクセスエラー
  }
  //getで値受取
  if(isset($_GET['product_id'])){
   $product_id = $_GET['product_id'];
  }
  else{
    //不正アクセスエラー
  }

  /*-------------------------------------
  db読み込み
  -------------------------------------*/

//  read_db();

  /*-------------------------------------
  req
  -------------------------------------*/
  require '../config/config.php';
  require '../model/func/func.php';
  require '../view/buy_procedures.html';
?>